<html>
<head>
	<title>タイトル</title>
</head>
<body>
<hr>
<h1>PHPの基本</h1>
<hr>
<h2>1.1.ルール</h2>
<h3>(1)プログラムの範囲</h3>


<h3>(2)HTMLとPHPを混ぜて書く</h3>


<hr>
<h2>1.2.for　ループ，繰り返し</h2>
<h3>(3)繰り返し</h3>


<h3>(4)添え字も出力</h3>


<hr>
<h2>1.3.if　分岐（ぶんき），分かれ道</h2>
<h3>(5)分岐</h3>


<h3>(6)条件に当てはまらない場合の処理</h3>


<h3>(7)文字列の比較</h3>


<hr>
<h2>1.4.if　変数（へんすう）</h2>
<h3>(8)変数</h3>


<hr>
<h2>1.5.配列（はいれつ）</h2>
<h3>(9)配列</h3>


<h3>(10)配列（array関数）</h3>


<hr>
<h2>1.6.配列の使い方</h2>
<h3>(11)セレクトボックス（HTML）</h3>


<h3>(12)セレクトボックス（変数）</h3>


<h3>(13)セレクトボックス（配列）</h3>


<hr>
<h2>1.7.//　と　/* ... */</h2>
<h3>(14)コメント</h3>


</body>
</html>